In [5]:
import pymysql
from pymysql import Error
import pandas as pd

In [6]:
#Create Connection
def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = pymysql.connect(
            host = host_name,
            user = user_name,
            passwd = user_password
        )
        print('MySQL Database Connection Successful')
    except Error as err:
        print(f"Error: '{err}'")
    return connection

pw = 'Experiment7'
db = 'mysql_python'
connection = create_server_connection('localhost', 'root', pw)

MySQL Database Connection Successful

In [7]:
#Create Database

def create_database(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        print('Database Created Successful')
    except Error as err:
        print(f"Error: '{err}'")
create_database_query = 'Create Database mysql_python'
create_database(connection, create_database_query)

Database Created Successful

In [11]:
#Connect to database

def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = pymysql.connect(
            host = host_name,
            user = user_name,
            passwd = user_password,
            database = db_name)
        print('MySQL database connection successful')
    except Error as err:
        print(f"Error: '{err}'")
    return connection

In [12]:
#Execute Queries

def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print('Query was successful')
    except Error as err:
        print(f"Error: '{err}'")

In [13]:
#Create Table

create_orders_table = """
create table orders(
order_id int primary key,
customer_name varchar(30) not null,
product_name varchar(20) not null,
date_ordered date,
quantity int,
unit_price float,
phone_number varchar(20));
"""
#Connect to the database
connection = create_db_connection('localhost', 'root', pw, db)
execute_query(connection, create_orders_table)

MySQL database connection successful
Query was successful

In [14]:
#Insert Data

data_orders = """
insert into orders values
(101, 'Steve', 'Laptop', '2018-06-12', 2, 800, '6293730802'),
(102, 'Jobs', 'Books', '2019-02-10', 10, 12, '8367489124'),
(103, 'Stacy', 'Trousers', '2019-12-25', 5, 50, '8976123645'),
(104, 'Nancy', 'T-Shirts', '2018-07-14', 7, 30, '7368145099'),
(105, 'Maria', 'Headphones', '2019-05-30', 6, 48, '8865316698'),
(106, 'Danny', 'Smart TV', '2018-08-20', 10, 300, '7720130449');
"""

connection = create_db_connection('localhost', 'root', pw, db)
execute_query(connection, data_orders)

MySQL database connection successful
Query was successful

In [15]:
def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"Error: '{err}'")

In [16]:
q1 = """
SELECT * FROM orders;
"""
connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q1)
for result in results:
    print(result)

MySQL database connection successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')
(102, 'Jobs', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '8367489124')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '8976123645')
(104, 'Nancy', 'T-Shirts', datetime.date(2018, 7, 14), 7, 30.0, '7368145099')
(105, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '8865316698')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '7720130449')

In [17]:
q2 = """
SELECT customer_name, phone_number FROM orders;
"""
connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q2)
for result in results:
    print(result)

MySQL database connection successful
('Steve', '6293730802')
('Jobs', '8367489124')
('Stacy', '8976123645')
('Nancy', '7368145099')
('Maria', '8865316698')
('Danny', '7720130449')

In [18]:
q3 = """
SELECT year(date_ordered) FROM orders;
"""
connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q3)
for result in results:
    print(result)

MySQL database connection successful
(2018,)
(2019,)
(2019,)
(2018,)
(2019,)
(2018,)

In [19]:
q4 = """
SELECT DISTINCT year(date_ordered) FROM orders;
"""
connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q4)
for result in results:
    print(result)

MySQL database connection successful
(2018,)
(2019,)

In [20]:
q5 = """
SELECT * FROM orders
WHERE date_ordered < '2018-12-31';
"""
connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q5)
for result in results:
    print(result)

MySQL database connection successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')
(104, 'Nancy', 'T-Shirts', datetime.date(2018, 7, 14), 7, 30.0, '7368145099')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '7720130449')

In [21]:
q6 = """
SELECT * FROM orders
WHERE date_ordered > '2018-12-31';
"""
connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q6)
for result in results:
    print(result)

MySQL database connection successful
(102, 'Jobs', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '8367489124')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '8976123645')
(105, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '8865316698')

In [23]:
q5 = """
SELECT * FROM orders
ORDER BY unit_price DESC;
"""
connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q5)
for result in results:
    print(result)

MySQL database connection successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '7720130449')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 50.0, '8976123645')
(105, 'Maria', 'Headphones', datetime.date(2019, 5, 30), 6, 48.0, '8865316698')
(104, 'Nancy', 'T-Shirts', datetime.date(2018, 7, 14), 7, 30.0, '7368145099')
(102, 'Jobs', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '8367489124')

In [26]:
#Converting result to list/DataFrame
from_db = []

for result in results:
    result = list(result)
    from_db.append(result)
columns = ['order_id', 'customer_name', 'product_name', 'date_ordered', 
           'quantity', 'unit_price', 'phone_number']

df = pd.DataFrame(from_db, columns = columns)
display(df)

,order_id,customer_name,product_name,date_ordered,quantity,unit_price,phone_number
0,101,Steve,Laptop,2018-06-12,2,800.0,6293730802
1,106,Danny,Smart TV,2018-08-20,10,300.0,7720130449
2,103,Stacy,Trousers,2019-12-25,5,50.0,8976123645
3,105,Maria,Headphones,2019-05-30,6,48.0,8865316698
4,104,Nancy,T-Shirts,2018-07-14,7,30.0,7368145099
5,102,Jobs,Books,2019-02-10,10,12.0,8367489124

In [27]:
#Update

update = """
UPDATE orders
SET unit_price = 45
WHERE order_id = 103
"""

connection = create_db_connection('localhost', 'root', pw, db)
execute_query(connection, update)

MySQL database connection successful
Query was successful

In [28]:
#Cross Checking
q8 = """
SELECT * FROM orders
WHERE order_id = 103;
"""
connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q8)
for result in results:
    print(result)

MySQL database connection successful
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 45.0, '8976123645')

In [29]:
#Delete Query

delete_order = """
DELETE FROM orders
WHERE order_id = 105;
"""

connection = create_db_connection('localhost', 'root', pw, db)
execute_query(connection, delete_order)

MySQL database connection successful
Query was successful

In [30]:
#Cross Checking
q9 = """
SELECT * FROM orders;
"""
connection = create_db_connection('localhost', 'root', pw, db)
results = read_query(connection, q9)
for result in results:
    print(result)

MySQL database connection successful
(101, 'Steve', 'Laptop', datetime.date(2018, 6, 12), 2, 800.0, '6293730802')
(102, 'Jobs', 'Books', datetime.date(2019, 2, 10), 10, 12.0, '8367489124')
(103, 'Stacy', 'Trousers', datetime.date(2019, 12, 25), 5, 45.0, '8976123645')
(104, 'Nancy', 'T-Shirts', datetime.date(2018, 7, 14), 7, 30.0, '7368145099')
(106, 'Danny', 'Smart TV', datetime.date(2018, 8, 20), 10, 300.0, '7720130449')